// 1. Ви прийшли в Макдональдз з трьома друзями.
//  Всі вони хочуть зʼїсти гамбургер. Ви хочете зʼїсти гамбургер з картоплею.
//  Реалізувати код, який буде перевіряти, що якщо всім вистачає гамбургерів і картоплі,
//  то виводити текст "Ми поїли" в консоль. Якщо на всіх не вистачає їжі,
//  то виводити в консоль текст "Ми йдемо в інше кафе"
//  (Змінні типу інтеджер містять кількість продуктів в наявності у вигляді вхідних даних)

const hamburger = 2;
const fries = 1;

if (hamburger >= 4 && fries >= 1) {
  console.log("Ми поїли");
} else if (hamburger < 3 || fries < 1) {
  console.log("Ми йдемо в інше кафе");
}




