// 5.  Задано 3 числа (a, b, c), які не рівні між собою.
// Визначити середнє мід цими трьома числами
// (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням) використовуючи оператор if-else.
// Використати вкладені оператори if
// Результат виводити в консоль.


let a = 40;
let b = 80;
let c = 1;

if (a > b) {
  if (a < c) {
    console.log("Медіана: a");
  } else if (b > c) {
    console.log("Медіана: b");
  } else {
    console.log("Медіана: c");
  }
}else {
    if (a > c) {
        console.log("Медіана: a");
    } else if (b < c) {
        console.log("Медіана: b");
    } else {
        console.log("Медіана: c");
    }
}
